---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.WorkplaneShouldBeLevel
source: html/e5bc1141-1a56-4bce-a3f7-02c2968d1a18.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.WorkplaneShouldBeLevel Property

Can't use Workplane that is not a Level. Set the desired Level as current Workplane.

## Syntax (C#)
```csharp
public static FailureDefinitionId WorkplaneShouldBeLevel { get; }
```